In [1]:
# Cleaning of the Sunshine List
#import dependencies
import pandas as pd

In [2]:
#File to Load 1996 t0 2019 to be used as dummy data
sunshine_data_to_load = "SunShine.csv"

In [3]:
# ***TO DO***
# Add sunshine 2020 csv to sunshine_data_df

In [4]:
# Create a DataFrame for the Sunshine data. 
sunshine_data_df = pd.read_csv(sunshine_data_to_load)

#display the data table for preview
sunshine_data_df.head()

,Sector,Last Name,First Name,Salary Paid,Taxable Benefits,Employer,Job Title,Calendar Year
0,COLLEGES,Gillett,Robert,127332.0,3633.0,Algonquin College of Applied Arts and Technology,President,1996
1,COLLEGES,Hanson,Raymonde,102999.0,5557.0,Algonquin College of Applied Arts and Technology,"V.P., Academic",1996
2,COLLEGES,Killeen,Philip,183482.0,878.0,Algonquin College of Applied Arts and Technology,Past President,1996
3,COLLEGES,Mitchelson,Robert,106608.0,5586.0,Algonquin College of Applied Arts and Technology,"V.P., Finance & Administration",1996
4,COLLEGES,Crombie,Glenn,111655.0,3177.0,Cambrian College of Applied Arts & Technology,President,1996

In [5]:
#review data types
sunshine_data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470706 entries, 0 to 1470705
Data columns (total 8 columns):
 #   Column            Non-Null Count    Dtype
---  ------            --------------    -----
 0   Sector            1470706 non-null  object
 1   Last Name         1470706 non-null  object
 2   First Name        1470703 non-null  object
 3   Salary Paid       1470706 non-null  float64
 4   Taxable Benefits  1470706 non-null  float64
 5   Employer          1470706 non-null  object
 6   Job Title         1470706 non-null  object
 7   Calendar Year     1470706 non-null  int64
dtypes: float64(2), int64(1), object(5)
memory usage: 89.8+ MB

In [6]:
#find null values
for column in sunshine_data_df.columns:
    print(f"Column {column} has {sunshine_data_df[column].isnull().sum()}null values")

Column Sector has 0null values
Column Last Name has 0null values
Column First Name has 3null values
Column Salary Paid has 0null values
Column Taxable Benefits has 0null values
Column Employer has 0null values
Column Job Title has 0null values
Column Calendar Year has 0null values

In [7]:
# Drop all rows with missing information
sunshine_data_df = sunshine_data_df.dropna(how='any')

In [8]:
# check that there are no null values
for column in sunshine_data_df.columns:
    print(f"Column {column} has {sunshine_data_df[column].isnull().sum()}null values")

Column Sector has 0null values
Column Last Name has 0null values
Column First Name has 0null values
Column Salary Paid has 0null values
Column Taxable Benefits has 0null values
Column Employer has 0null values
Column Job Title has 0null values
Column Calendar Year has 0null values

In [9]:
#Change Salary to numeric
# Use pd.to_numeric() method to convert the datatype of the Amount column
# df['Amount'] = pd.to_numeric(df['Amount'])
sunshine_data_df['Salary Paid'] = sunshine_data_df['Salary Paid'].astype(str). astype(float)

In [10]:
# sunshine_data_df.info()

# First Name column data cleansing

In [11]:
# Convert all sunshine_data_df['First Name'] to str.lower()
# df['Fruits'] = df['Fruits'].str.lower()
sunshine_data_df['First Name']=sunshine_data_df['First Name'].str.lower()

In [12]:
#copy 'First Name' column and create 'Clean First Name' column and 'Clean Alt First Name'
sunshine_data_df['clean_first_name'] = sunshine_data_df['First Name']
sunshine_data_df['clean_alt_first_name'] = sunshine_data_df['First Name']

In [13]:
# # Cleaning First Name with titles and Replacing Substrings in a Python String
# # Add each prefix and suffix to remove to a list.
prefixes_suffixes = ["dr. ", "dr ","-", "jr. ",".", "ms. ", "md. ", "mr. ", "(dr)", "(", ")"]

# # Iterate through the words in the "prefixes_suffixes" list and replace them with an empty space, "".
for word in prefixes_suffixes:
    sunshine_data_df["clean_first_name"] = sunshine_data_df["clean_first_name"].str.replace(word,"")

C:\Users\Danielle Spring\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:7: FutureWarning: The default value of regex will change from True to False in a future version.
  import sys
C:\Users\Danielle Spring\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:7: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  import sys

** TO DO ** 
Create a district list of First Names to be used for Machine Learning Model

In [14]:
# first_count=sunshine_data_df['First Name'].str.lower().value_counts()
first_count=sunshine_data_df['First Name'].value_counts()
first_count

david         27551
john          26541
michael       26074
robert        21602
paul          16261
              ...
debora l.         1
 clive            1
todd m. a.        1
susanjane         1
tatiana d         1
Name: First Name, Length: 62548, dtype: int64

In [15]:
# Creating a new DataFrame using both duration and count
# urban_ride_count=urban_cities_df.groupby(["city"]).count()["ride_id"]
# first_name_count=sunshine_data_df.groupby(["First Name"]).count()["First Name"]
first_name_table = pd.DataFrame({"first_name_counts": first_count})

# Last Name column data cleansing

In [16]:
# Convert all sunshine_data_df['First Name'] to str.lower()
# df['Fruits'] = df['Fruits'].str.lower()
sunshine_data_df['Last Name']=sunshine_data_df['Last Name'].str.lower()

# Add new columns

In [17]:
#Create Gender column
sunshine_data_df["gender"] = None

In [18]:
#Create Age column
sunshine_data_df["age"] = 0

In [19]:
#Create unique employee 'Last, First Name' column
#concatenate Last and First Name
sunshine_data_df["last_first_name"]=sunshine_data_df["Last Name"]+"_"+sunshine_data_df["First Name"]

# Prepare for output

In [21]:
# # Reorder the columns in the sunshine_data DataFrame.
sunshine_data_df = sunshine_data_df.reindex(columns=['Calendar Year',
                                                     'Sector' ,
                                                     'Employer',
                                                     'Job Title',
                                                     'last_first_name',
                                                     'Last Name',
                                                     'First Name',
                                                     'clean_first_name',
                                                     'clean_alt_first_name',
                                                     'gender',
                                                     'age',
                                                     'Salary Paid',
                                                     'Taxable Benefits']
                                           )

In [22]:
# Rename the columns in the sunshine_data DataFrame.### changed to match 2020 data
sunshine_data_df.rename({'Calendar Year':'year',
                      'Sector':'sector',
                      'Employer': 'employer',
                      'Job Title':'job_title',
                      'Last_First_Name':'last_first_name',
                      'Last Name': 'last_name',
                      'First Name':'first_name',
                      'clean_first_name':'clean_first_name',
                      'clean_alt_first_name':'clean_alt_first_name',
                      'gender':'gender',
                      'age':'age',
                      'Salary Paid':'salary_paid',
                      'Taxable Benefits':'taxable_benefits'
                    }, axis='columns', inplace=True)

In [23]:
# Export to csv 
sunshine_data_df.to_csv("Clean_SunShine.csv", index=False)
sunshine_data_df.head()

,year,sector,employer,job_title,last_first_name,last_name,first_name,clean_first_name,clean_alt_first_name,gender,age,salary_paid,taxable_benefits
0,1996,COLLEGES,Algonquin College of Applied Arts and Technology,President,gillett_robert,gillett,robert,robert,robert,None,0,127332.0,3633.0
1,1996,COLLEGES,Algonquin College of Applied Arts and Technology,"V.P., Academic",hanson_raymonde,hanson,raymonde,raymonde,raymonde,None,0,102999.0,5557.0
2,1996,COLLEGES,Algonquin College of Applied Arts and Technology,Past President,killeen_philip,killeen,philip,philip,philip,None,0,183482.0,878.0
3,1996,COLLEGES,Algonquin College of Applied Arts and Technology,"V.P., Finance & Administration",mitchelson_robert,mitchelson,robert,robert,robert,None,0,106608.0,5586.0
4,1996,COLLEGES,Cambrian College of Applied Arts & Technology,President,crombie_glenn,crombie,glenn,glenn,glenn,None,0,111655.0,3177.0

In [26]:
sunshine_data_df.dtypes

year                      int64
sector                   object
employer                 object
job_title                object
last_first_name          object
last_name                object
first_name               object
clean_first_name         object
clean_alt_first_name     object
gender                   object
age                       int64
salary_paid             float64
taxable_benefits        float64
dtype: object